In [14]:
import pandas as pd

# Sample data with missing values
csv_data = """Name,Age,Department,Salary
Aarav,28,Sales,50000
Sneha,,Engineering,80000
Kabir,25,HR,
Anaya,29,,60000
Rohan,35,Engineering,85000
"""

with open('emp_missing.csv','w') as file:
  file.write(csv_data)

df = pd.read_csv('emp_missing.csv')
print(df)

    Name   Age   Department   Salary
0  Aarav  28.0        Sales  50000.0
1  Sneha   NaN  Engineering  80000.0
2  Kabir  25.0           HR      NaN
3  Anaya  29.0          NaN  60000.0
4  Rohan  35.0  Engineering  85000.0

In [15]:
#check for missing data returns True/False
print(df.isnull())

    Name    Age  Department  Salary
0  False  False       False   False
1  False   True       False   False
2  False  False       False    True
3  False  False        True   False
4  False  False       False   False

In [16]:
# Columnwise Count missing values
print(df.isnull().sum())

Name          0
Age           1
Department    1
Salary        1
dtype: int64

In [17]:
# Not suggested as it deletes entire records with null values
df_cleaned= df.dropna()
print(df_cleaned)

    Name   Age   Department   Salary
0  Aarav  28.0        Sales  50000.0
4  Rohan  35.0  Engineering  85000.0

In [18]:
# Filling values with fillna()
df['Age'] = df['Age'].fillna(df['Age'].mean())
print(df)

    Name    Age   Department   Salary
0  Aarav  28.00        Sales  50000.0
1  Sneha  29.25  Engineering  80000.0
2  Kabir  25.00           HR      NaN
3  Anaya  29.00          NaN  60000.0
4  Rohan  35.00  Engineering  85000.0

In [19]:
df['Department']= df['Department'].fillna('Unknown')
print(df)

    Name    Age   Department   Salary
0  Aarav  28.00        Sales  50000.0
1  Sneha  29.25  Engineering  80000.0
2  Kabir  25.00           HR      NaN
3  Anaya  29.00      Unknown  60000.0
4  Rohan  35.00  Engineering  85000.0

In [20]:
df['Salary'] = df['Salary'].fillna(0)
print(df)

    Name    Age   Department   Salary
0  Aarav  28.00        Sales  50000.0
1  Sneha  29.25  Engineering  80000.0
2  Kabir  25.00           HR      0.0
3  Anaya  29.00      Unknown  60000.0
4  Rohan  35.00  Engineering  85000.0